--problem 08 :
-- The "Key Lookup" Mystery (Covering Indexes)
-- الاندكس الحالي مش كفاية لانه موجود على الاوردر ديت بس يعني مش شامل على كل حاجه 
-- واحنا لما بنيجي نستعلم عن حاجه بيكون فالاغلب لاكتر من اتريبيوت والاندكس الحالي بيحدد صفوف بس 
-- فده بيبطيء البيرفورمانس خاصة لو عدد الصفوف كبير فيجيب تايم ليميت
-- بمعنى ان الاندكس موجود بس مش كافي لأن محتاج كل الأعمدة اللي الاستعلام عايزها موجودة في الاندكس نفسه
-- وهنحلها بالكافرينج اندكس لانه بيشمل كل حاجه والاستعلامات اللي بستخدمها بالاتريبيوتس
-- : الكويري بتاعته 
Create Index order On Orders (order_date) INCLUDE (customer_id, total_amount);

-- وبكده يكون الاستعلام هيبقى سريع جدًا والداتا بيز هيمشي كله على الاندكس